backend/controllers/RolController.php

SELECT * FROM `operacion`
---
    public function actionCreate()
{
    $model = new Rol();
    $tipoOperaciones = Operacion::find()->all();

SELECT * FROM `operacion`
SELECT * FROM `rol_operacion` WHERE `rol_id`=2
---
    public function actionUpdate($id)
{
    $model = $this->findModel($id);
    $tipoOperaciones = Operacion::find()->all();

    $model->operaciones = \yii\helpers\ArrayHelper::getColumn(
        $model->getRolOperaciones()->asArray()->all(),
        'operacion_id'
    );

SELECT * FROM `rol` WHERE `id`='2'
---
    protected function findModel($id)
    {
        if (($model = Rol::findOne($id)) !== null) {