common/models/User.php

SELECT * FROM `user` WHERE (`verification_token`='vM08wYXbZDr5MF_gtT2Lmyl9R7vpQEqy_1583937872') AND (`status`=9)
---
    public static function findByVerificationToken($token) {
        return static::findOne([
            'verification_token' => $token,
            'status' => self::STATUS_INACTIVE
        ]);