backend/models/Rol.php

DELETE FROM `rol_operacion` WHERE rol_id = 2
INSERT INTO `rol_operacion` (`rol_id`, `operacion_id`) VALUES (2, 1)
---
    public function afterSave($insert, $changedAttributes)
    {
        \Yii::$app->db->createCommand()->delete('rol_operacion', 'rol_id = '.(int) $this->id)->execute();

        foreach ($this->operaciones as $id) {
            $ro = new RolOperacion();
            $ro->rol_id = $this->id;
            $ro->operacion_id = $id;
            $ro->save();